@rifisdfds Good catch. I matched the branch protections on the `platform-manifests-qa` (reverted it back now) repo to the ones on `platform-manifests` and I cannot reproduce that issue.

From testing on the sandbox in the services phase it just repeatedly proposes these changes:

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.atlantis_flux_manifests[0].data.github_repository.flux_repo will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository" "flux_repo" {
      + allow_auto_merge            = (known after apply)
      + allow_merge_commit          = (known after apply)
      + allow_rebase_merge          = (known after apply)
      + allow_squash_merge          = (known after apply)
      + archived                    = (known after apply)
      + default_branch              = (known after apply)
      + full_name                   = "dfds/platform-manifests-qa"
      + git_clone_url               = (known after apply)
      + has_downloads               = (known after apply)
      + has_issues                  = (known after apply)
      + has_projects                = (known after apply)
      + has_wiki                    = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = (known after apply)
      + merge_commit_title          = (known after apply)
      + name                        = (known after apply)
      + node_id                     = (known after apply)
      + pages                       = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = (known after apply)
      + squash_merge_commit_title   = (known after apply)
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
    }

  # module.atlantis_flux_manifests[0].github_repository_file.atlantis_config_ingressroute will be updated in-place
  ~ resource "github_repository_file" "atlantis_config_ingressroute" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/atlantis/config/ingressroute-atlantis.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.atlantis_flux_manifests[0].github_repository_file.atlantis_config_init will be updated in-place
  ~ resource "github_repository_file" "atlantis_config_init" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/atlantis/config/kustomization.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.atlantis_flux_manifests[0].github_repository_file.atlantis_config_middleware will be updated in-place
  ~ resource "github_repository_file" "atlantis_config_middleware" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/atlantis/config/middleware-atlantis.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.atlantis_flux_manifests[0].github_repository_file.atlantis_config_path will be updated in-place
  ~ resource "github_repository_file" "atlantis_config_path" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/platform-apps-atlantis-config.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.platform_fluxcd[0].github_repository_file.flux_monitoring_config_path will be updated in-place
  ~ resource "github_repository_file" "flux_monitoring_config_path" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/platform-apps-flux-monitoring.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.platform_fluxcd[0].github_repository_file.install will be updated in-place
  ~ resource "github_repository_file" "install" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/flux-system/gotk-components.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.platform_fluxcd[0].github_repository_file.kustomize will be updated in-place
  ~ resource "github_repository_file" "kustomize" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/flux-system/kustomization.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.platform_fluxcd[0].github_repository_file.platform_apps_init will be updated in-place
  ~ resource "github_repository_file" "platform_apps_init" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/platform-apps.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.platform_fluxcd[0].github_repository_file.sync will be updated in-place
  ~ resource "github_repository_file" "sync" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/flux-system/gotk-sync.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_config_dashboard_ingressroute[0] will be updated in-place
  ~ resource "github_repository_file" "traefik_config_dashboard_ingressroute" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/traefik/config/ingressroute-dashboard.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_config_dashboard_middleware[0] will be updated in-place
  ~ resource "github_repository_file" "traefik_config_dashboard_middleware" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/traefik/config/middleware-dashboard.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_config_dashboard_secret[0] will be updated in-place
  ~ resource "github_repository_file" "traefik_config_dashboard_secret" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/traefik/config/secret-dashboard.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_config_init will be updated in-place
  ~ resource "github_repository_file" "traefik_config_init" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/traefik/config/kustomization.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_config_path will be updated in-place
  ~ resource "github_repository_file" "traefik_config_path" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/platform-apps-traefik-config.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_helm will be updated in-place
  ~ resource "github_repository_file" "traefik_helm" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/clusters/lund/platform-apps-traefik-helm.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_helm_install will be updated in-place
  ~ resource "github_repository_file" "traefik_helm_install" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/traefik/helm/kustomization.yaml"
        # (8 unchanged attributes hidden)
    }

  # module.traefik_flux_manifests[0].github_repository_file.traefik_helm_patch will be updated in-place
  ~ resource "github_repository_file" "traefik_helm_patch" {
      - commit_author       = "Dev-Excellence Service Account" -> null
      - commit_email        = "65592364+devex-sa@users.noreply.github.com" -> null
        id                  = "platform-manifests-qa/platform-apps/lund/traefik/helm/patch.yaml"
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```